MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
<?xml version="1.0" encoding="UTF-8"?>

<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2012, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR    -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->

<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAMA5D35-CU" package="BGA324" speedmax="+0" tempmax="+0" tempmin="+0" vccmax="+0" vccmin="+0"/>
  </variants>
  <devices>
    <device architecture="CORTEX-A5" family="SAMA5" name="ATSAMA5D35">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="EBI_CS0" start="0x10000000" size="0x10000000" type="other"/>
          <memory-segment name="DDR_CS" start="0x20000000" size="0x20000000" type="other"/>
          <memory-segment name="EBI_CS1" start="0x40000000" size="0x10000000" type="other"/>
          <memory-segment name="EBI_CS2" start="0x50000000" size="0x10000000" type="other"/>
          <memory-segment name="EBI_CS3" start="0x60000000" size="0x10000000" type="other"/>
          <memory-segment name="EBI_NF" start="0x60000000" size="0x10000000" type="other"/>
          <memory-segment name="NFC" start="0x70000000" size="0x10000000" type="other"/>
          <memory-segment name="IROM" start="0x00100000" size="0x00020000" type="rom"/>
          <memory-segment name="IRAM0" start="0x00300000" size="0x00010000" type="ram"/>
          <memory-segment name="IRAM1" start="0x00310000" size="0x00010000" type="ram"/>
          <memory-segment name="SMD" start="0x00400000" size="0x00100000" type="other"/>
          <memory-segment name="UDPHS_RAM" start="0x00500000" size="0x00100000" type="other"/>
          <memory-segment name="UHP_OHCI" start="0x00600000" size="0x00100000" type="other"/>
          <memory-segment name="UHP_EHCI" start="0x00700000" size="0x00100000" type="other"/>
          <memory-segment name="AXIMX" start="0x00800000" size="0x00100000" type="other"/>
          <memory-segment name="DAP" start="0x00900000" size="0x00100000" type="other"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="ADC" id="ADC" version="6489J">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0xF8018000"/>
            <signals>
              <signal pad="PD19" function="A" group="ADTRG"/>
              <signal pad="PD20" function="A" group="AD" index="0"/>
              <signal pad="PD21" function="A" group="AD" index="1"/>
              <signal pad="PD22" function="A" group="AD" index="2"/>
              <signal pad="PD23" function="A" group="AD" index="3"/>
              <signal pad="PD24" function="A" group="AD" index="4"/>
              <signal pad="PD25" function="A" group="AD" index="5"/>
              <signal pad="PD26" function="A" group="AD" index="6"/>
              <signal pad="PD27" function="A" group="AD" index="7"/>
              <signal pad="PD28" function="A" group="AD" index="8"/>
              <signal pad="PD29" function="A" group="AD" index="9"/>
              <signal pad="PD30" function="A" group="AD" index="10"/>
              <signal pad="PD31" function="A" group="AD" index="11"/>
            </signals>
          </instance>
        </module>
        <module name="AIC" id="AIC" version="11051B">
          <instance name="AIC">
            <register-group address-space="base" name="AIC" name-in-module="AIC" offset="0xFFFFF000"/>
            <signals>
              <signal pad="PC31" function="A" group="FIQ"/>
              <signal pad="PE31" function="A" group="IRQ"/>
            </signals>
          </instance>
        </module>
        <module name="AXIMX" id="AXIMX" version="11103A">
          <instance name="AXIMX">
            <register-group address-space="base" name="AXIMX" name-in-module="AXIMX" offset="0x00800000"/>
