MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <module name="MATRIX" id="MATRIX" version="6342C">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0xFFFFEC00"/>
          </instance>
        </module>
        <module name="MPDDRC" id="MPDDRC" version="11043C">
          <instance name="MPDDRC">
            <register-group address-space="base" name="MPDDRC" name-in-module="MPDDRC" offset="0xFFFFEA00"/>
          </instance>
        </module>
        <module name="PIO" id="PIO" version="11004G">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0xFFFFF200"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0xFFFFF400"/>
          </instance>
          <instance name="PIOC">
            <register-group address-space="base" name="PIOC" name-in-module="PIO" offset="0xFFFFF600"/>
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0xFFFFF800"/>
          </instance>
          <instance name="PIOE">
            <register-group address-space="base" name="PIOE" name-in-module="PIO" offset="0xFFFFFA00"/>
          </instance>
        </module>
        <module name="PIT" id="PIT" version="6079B">
          <instance name="PIT">
            <register-group address-space="base" name="PIT" name-in-module="PIT" offset="0xFFFFFE30"/>
          </instance>
        </module>
        <module name="PMC" id="PMC" version="11041A">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0xFFFFFC00"/>
            <signals>
              <signal pad="PD30" function="B" group="PCK" index="0"/>
              <signal pad="PD31" function="B" group="PCK" index="1"/>
              <signal pad="PC15" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" id="PWM" version="6343I">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0xF002C000"/>
            <signals>
              <signal pad="PC28" function="B" group="PWMFI" index="0"/>
              <signal pad="PC31" function="B" group="PWMFI" index="1"/>
              <signal pad="PC29" function="B" group="PWMFI" index="2"/>
              <signal pad="PD16" function="C" group="PWMFI" index="3"/>
              <signal pad="PA20" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="B" group="PWMH" index="0"/>
              <signal pad="PA22" function="B" group="PWMH" index="1"/>
              <signal pad="PB4" function="B" group="PWMH" index="1"/>
              <signal pad="PB27" function="C" group="PWMH" index="1"/>
              <signal pad="PB8" function="B" group="PWMH" index="2"/>
              <signal pad="PD5" function="C" group="PWMH" index="2"/>
              <signal pad="PB12" function="B" group="PWMH" index="3"/>
              <signal pad="PD7" function="C" group="PWMH" index="3"/>
              <signal pad="PA21" function="B" group="PWML" index="0"/>
              <signal pad="PB1" function="B" group="PWML" index="0"/>
              <signal pad="PA23" function="B" group="PWML" index="1"/>
              <signal pad="PB5" function="B" group="PWML" index="1"/>
              <signal pad="PE31" function="B" group="PWML" index="1"/>
              <signal pad="PB9" function="B" group="PWML" index="2"/>
              <signal pad="PD6" function="C" group="PWML" index="2"/>
              <signal pad="PB13" function="B" group="PWML" index="3"/>
              <signal pad="PD8" function="C" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" id="RSTC" version="6098I">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0xFFFFFE00"/>
          </instance>
        </module>
        <module name="RTC" id="RTC" version="6056I">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0xFFFFFEB0"/>
          </instance>
        </module>
        <module name="SCKC" id="SCKC" version="11073B">
          <instance name="SCKC">
            <register-group address-space="base" name="SCKC" name-in-module="SCKC" offset="0xFFFFFE50"/>
          </instance>
        </module>
        <module name="SFR" id="SFR" version="11066A">
          <instance name="SFR">
            <register-group address-space="base" name="SFR" name-in-module="SFR" offset="0xF0038000"/>
          </instance>
        </module>
        <module name="SHDWC" id="SHDWC" version="6122L">
          <instance name="SHDWC">
            <register-group address-space="base" name="SHDWC" name-in-module="SHDWC" offset="0xFFFFFE10"/>
          </instance>
        </module>
        <module name="SMC" id="SMC" version="11036C">
          <instance name="SMC">
            <register-group address-space="base" name="SMC" name-in-module="SMC" offset="0xFFFFC000"/>
          </instance>
        </module>
        <module name="SMD" id="SMD" version="11027A">
          <instance name="SMD">
            <register-group address-space="base" name="SMD" name-in-module="SMD" offset="0x00400000"/>
          </instance>
        </module>
        <module name="SPI" id="SPI" version="6088R">
          <instance name="SPI0">
            <register-group address-space="base" name="SPI0" name-in-module="SPI" offset="0xF0004000"/>
            <signals>
              <signal pad="PD10" function="A" group="SPI0_MISO"/>
              <signal pad="PD11" function="A" group="SPI0_MOSI"/>
              <signal pad="PD13" function="A" group="SPI0_NPCS" index="0"/>
              <signal pad="PD14" function="B" group="SPI0_NPCS" index="1"/>
              <signal pad="PD15" function="B" group="SPI0_NPCS" index="2"/>
              <signal pad="PD16" function="B" group="SPI0_NPCS" index="3"/>
              <signal pad="PD12" function="A" group="SPI0_SPCK"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group address-space="base" name="SPI1" name-in-module="SPI" offset="0xF8008000"/>
            <signals>
              <signal pad="PC22" function="A" group="SPI1_MISO"/>
              <signal pad="PC23" function="A" group="SPI1_MOSI"/>
              <signal pad="PC25" function="A" group="SPI1_NPCS" index="0"/>
              <signal pad="PC26" function="A" group="SPI1_NPCS" index="1"/>
              <signal pad="PC27" function="A" group="SPI1_NPCS" index="2"/>
              <signal pad="PC28" function="A" group="SPI1_NPCS" index="3"/>
              <signal pad="PC24" function="A" group="SPI1_SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SSC" id="SSC" version="6078J">
          <instance name="SSC0">
            <register-group address-space="base" name="SSC0" name-in-module="SSC" offset="0xF0008000"/>
            <signals>
              <signal pad="PC21" function="A" group="RD" index="0"/>
              <signal pad="PC20" function="A" group="RF" index="0"/>
              <signal pad="PC19" function="A" group="RK" index="0"/>
              <signal pad="PC18" function="A" group="TD" index="0"/>
              <signal pad="PC17" function="A" group="TF" index="0"/>
              <signal pad="PC16" function="A" group="TK" index="0"/>
            </signals>
          </instance>
          <instance name="SSC1">
            <register-group address-space="base" name="SSC1" name-in-module="SSC" offset="0xF800C000"/>
            <signals>
              <signal pad="PB11" function="B" group="RD" index="1"/>
              <signal pad="PB10" function="B" group="RF" index="1"/>
              <signal pad="PB7" function="B" group="RK" index="1"/>
              <signal pad="PB6" function="B" group="TD" index="1"/>
              <signal pad="PB3" function="B" group="TF" index="1"/>
              <signal pad="PB2" function="B" group="TK" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="TC" id="TC" version="6082Q">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0xF0010000"/>
            <signals>
              <signal pad="PD7" function="B" group="TCLK" index="0"/>
              <signal pad="PC14" function="B" group="TCLK" index="1"/>
              <signal pad="PE29" function="B" group="TCLK" index="2"/>
              <signal pad="PD5" function="B" group="TIOA" index="0"/>
              <signal pad="PC12" function="B" group="TIOA" index="1"/>
              <signal pad="PE27" function="B" group="TIOA" index="2"/>
              <signal pad="PD6" function="B" group="TIOB" index="0"/>
              <signal pad="PC13" function="B" group="TIOB" index="1"/>
              <signal pad="PE28" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0xF8014000"/>
            <signals>
              <signal pad="PC2" function="B" group="TCLK" index="3"/>
              <signal pad="PC5" function="B" group="TCLK" index="4"/>
              <signal pad="PC8" function="B" group="TCLK" index="5"/>
              <signal pad="PC0" function="B" group="TIOA" index="3"/>
              <signal pad="PC3" function="B" group="TIOA" index="4"/>
              <signal pad="PC6" function="B" group="TIOA" index="5"/>
              <signal pad="PC1" function="B" group="TIOB" index="3"/>
              <signal pad="PC4" function="B" group="TIOB" index="4"/>
              <signal pad="PC7" function="B" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
