MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="Channel Data Register 5" name="ADC_CDR5" offset="0x64" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 6" name="ADC_CDR6" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 7" name="ADC_CDR7" offset="0x6C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 8" name="ADC_CDR8" offset="0x70" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 9" name="ADC_CDR9" offset="0x74" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 10" name="ADC_CDR10" offset="0x78" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 11" name="ADC_CDR11" offset="0x7C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Pen Detection Sensitivity" mask="0x00000003" name="PENDETSENS"/>
          <bitfield caption="ADC Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="Touchscreen Mode Register" name="ADC_TSMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Touchscreen Mode" mask="0x00000003" name="TSMODE" values="ADC_TSMR__TSMODE"/>
          <bitfield caption="Touchscreen Average" mask="0x00000030" name="TSAV" values="ADC_TSMR__TSAV"/>
          <bitfield caption="Touchscreen Frequency" mask="0x00000F00" name="TSFREQ"/>
          <bitfield caption="Touchscreen Switches Closure Time" mask="0x000F0000" name="TSSCTIM"/>
          <bitfield caption="No TouchScreen DMA" mask="0x00400000" name="NOTSDMA"/>
          <bitfield caption="Pen Contact Detection Enable" mask="0x01000000" name="PENDET"/>
          <bitfield caption="Pen Detect Debouncing Period" mask="0xF0000000" name="PENDBC"/>
        </register>
        <register caption="Touchscreen X Position Register" name="ADC_XPOSR" offset="0xB4" rw="R" size="4">
          <bitfield caption="X Position" mask="0x00000FFF" name="XPOS"/>
          <bitfield caption="Scale of XPOS" mask="0x0FFF0000" name="XSCALE"/>
        </register>
        <register caption="Touchscreen Y Position Register" name="ADC_YPOSR" offset="0xB8" rw="R" size="4">
          <bitfield caption="Y Position" mask="0x00000FFF" name="YPOS"/>
          <bitfield caption="Scale of YPOS" mask="0x0FFF0000" name="YSCALE"/>
        </register>
        <register caption="Touchscreen Pressure Register" name="ADC_PRESSR" offset="0xBC" rw="R" size="4">
          <bitfield caption="Data of Z1 Measurement" mask="0x00000FFF" name="Z1"/>
          <bitfield caption="Data of Z2 Measurement" mask="0x0FFF0000" name="Z2"/>
        </register>
        <register caption="Trigger Register" name="ADC_TRGR" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Trigger Mode" mask="0x00000007" name="TRGMOD" values="ADC_TRGR__TRGMOD"/>
          <bitfield caption="Trigger Period" mask="0xFFFF0000" name="TRGPER"/>
        </register>
        <register caption="Write Protect Mode Register" name="ADC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="ADC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="ADC_MR__TRGSEL">
        <value caption="ADTRG" name="ADC_TRIG0" value="0x0"/>
        <value caption="TIOA0" name="ADC_TRIG1" value="0x1"/>
        <value caption="TIOA1" name="ADC_TRIG2" value="0x2"/>
        <value caption="TIOA2" name="ADC_TRIG3" value="0x3"/>
        <value caption="PWM event line 0" name="ADC_TRIG4" value="0x4"/>
        <value caption="PWM_even line 1" name="ADC_TRIG5" value="0x5"/>
      </value-group>
      <value-group caption="" name="ADC_MR__LOWRES">
        <value caption="12-bit resolution" name="BITS_12" value="0"/>
        <value caption="10-bit resolution" name="BITS_10" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SLEEP">
        <value caption="Normal Mode: The ADC Core and reference voltage circuitry are kept ON between conversions" name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The ADC Core and reference voltage circuitry are OFF between conversions" name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__FWUP">
        <value caption="Normal Sleep Mode: The sleep mode is defined by the SLEEP bit" name="OFF" value="0"/>
        <value caption="Fast Wake Up Sleep Mode: The Voltage reference is ON between conversions and ADC Core is OFF" name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCClock" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCClock" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCClock" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCClock" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCClock" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCClock" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCClock" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCClock" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCClock" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCClock" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCClock" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCClock" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCClock" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCClock" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCClock" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCClock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__SETTLING">
        <value caption="3 periods of ADCClock" name="AST3" value="0x0"/>
        <value caption="5 periods of ADCClock" name="AST5" value="0x1"/>
        <value caption="9 periods of ADCClock" name="AST9" value="0x2"/>
        <value caption="17 periods of ADCClock" name="AST17" value="0x3"/>
      </value-group>
