MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="ASIB0 Read Channel QoS Register" name="AXIMX_ASIB0_READ_QOS" offset="0x42100" rw="RW" size="4">
          <bitfield caption="Read QoS" mask="0x0000000F" name="RD_QOS"/>
        </register>
        <register caption="ASIB0 Write Channel QoS Register" name="AXIMX_ASIB0_WRITE_QOS" offset="0x42104" rw="RW" size="4">
          <bitfield caption="Write QoS" mask="0x0000000F" name="WR_QOS"/>
        </register>
        <register caption="ASIB1 AHB Functionality Modification Register" name="AXIMX_ASIB1_FN_MOD_AHB" offset="0x43028" rw="RW" size="4">
          <bitfield caption="Read INCR Override" mask="0x00000001" name="RD_INCR_OVR"/>
          <bitfield caption="Write INCR override" mask="0x00000002" name="WR_INCR_OVR"/>
          <bitfield caption="Lock Override" mask="0x00000004" name="LOCK_OVR"/>
        </register>
        <register caption="ASIB1 Read Channel QoS Register" name="AXIMX_ASIB1_READ_QOS" offset="0x43100" rw="RW" size="4">
          <bitfield caption="Read QoS" mask="0x0000000F" name="RD_QOS"/>
        </register>
        <register caption="ASIB1 Write Channel QoS Register" name="AXIMX_ASIB1_WRITE_QOS" offset="0x43104" rw="RW" size="4">
          <bitfield caption="Write QoS" mask="0x0000000F" name="WR_QOS"/>
        </register>
        <register caption="ASIB1 Issuing Functionality Modification Register" name="AXIMX_ASIB1_FN_MOD" offset="0x43108" rw="RW" size="4">
          <bitfield caption="Read Issuing" mask="0x00000001" name="RD_ISS"/>
          <bitfield caption="Write Issuing" mask="0x00000002" name="WR_ISS"/>
        </register>
      </register-group>
      <value-group caption="" name="AXIMX_PERIPH_ID4__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID5__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID6__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID7__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID0__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID1__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID2__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID3__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
    </module>
    <module caption="Boot Sequence Controller" name="BSC" version="11072B">
      <register-group name="BSC">
        <register caption="Boot Sequence Configuration Register" name="BSC_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Boot media sequence" mask="0x000000FF" name="BOOT"/>
          <bitfield caption="" mask="0xFFFF0000" name="BOOTKEY" values="BSC_CR__BOOTKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="BSC_CR__BOOTKEY">
        <value caption="valid key to write BSC_CR register; it needs to be written at the same time as the BOOT field." name="BSC_KEY" value="0x6683"/>
      </value-group>
    </module>
    <module caption="Controller Area Network" name="CAN" version="6019N">
      <register-group name="CAN">
        <register caption="Mode Register" name="CAN_MR" offset="0x0000" rw="RW" size="4">
          <bitfield caption="CAN Controller Enable" mask="0x00000001" name="CANEN"/>
          <bitfield caption="Disable/Enable Low Power Mode" mask="0x00000002" name="LPM"/>
          <bitfield caption="Disable/Enable Autobaud/Listen mode" mask="0x00000004" name="ABM"/>
          <bitfield caption="Disable/Enable Overload Frame" mask="0x00000008" name="OVL"/>
          <bitfield caption="Timestamp messages at each end of Frame" mask="0x00000010" name="TEOF"/>
          <bitfield caption="Disable/Enable Time Triggered Mode" mask="0x00000020" name="TTM"/>
          <bitfield caption="Enable Timer Freeze" mask="0x00000040" name="TIMFRZ"/>
          <bitfield caption="Disable Repeat" mask="0x00000080" name="DRPT"/>
        </register>
        <register caption="Interrupt Enable Register" name="CAN_IER" offset="0x0004" rw="W" size="4">
          <bitfield caption="Mailbox 0 Interrupt Enable" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Enable" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Enable" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Enable" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Enable" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Enable" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Enable" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Enable" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Enable" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Enable" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Enable" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Enable" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Enable" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Enable" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt Enable" mask="0x00400000" name="TOVF"/>
          <bitfield caption="TimeStamp Interrupt Enable" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Enable" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Enable" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Enable" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Enable" mask="0x10000000" name="BERR"/>
        </register>
