MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
      <value-group caption="" name="CAN_MMR3__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR4__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR5__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR6__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
      <value-group caption="" name="CAN_MMR7__MOT">
        <value caption="Mailbox is disabled. This prevents receiving or transmitting any messages with this mailbox." name="MB_DISABLED" value="0x0"/>
        <value caption="Reception Mailbox. Mailbox is configured for reception. If a message is received while the mailbox data register is full, it is discarded." name="MB_RX" value="0x1"/>
        <value caption="Reception mailbox with overwrite. Mailbox is configured for reception. If a message is received while the mailbox is full, it overwrites the previous message." name="MB_RX_OVERWRITE" value="0x2"/>
        <value caption="Transmit mailbox. Mailbox is configured for transmission." name="MB_TX" value="0x3"/>
        <value caption="Consumer Mailbox. Mailbox is configured in reception but behaves as a Transmit Mailbox, i.e., it sends a remote frame and waits for an answer." name="MB_CONSUMER" value="0x4"/>
        <value caption="Producer Mailbox. Mailbox is configured in transmission but also behaves like a reception mailbox, i.e., it waits to receive a Remote Frame before sending its contents." name="MB_PRODUCER" value="0x5"/>
      </value-group>
    </module>
    <module caption="Debug Unit" name="DBGU" version="6059M">
      <register-group name="DBGU">
        <register caption="Control Register" name="DBGU_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
        </register>
        <register caption="Mode Register" name="DBGU_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="DBGU_MR__PAR"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="DBGU_MR__CHMODE"/>
        </register>
        <register caption="Interrupt Enable Register" name="DBGU_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Enable COMMTX (from ARM) Interrupt" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Enable COMMRX (from ARM) Interrupt" mask="0x80000000" name="COMMRX"/>
        </register>
        <register caption="Interrupt Disable Register" name="DBGU_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Disable COMMTX (from ARM) Interrupt" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Disable COMMRX (from ARM) Interrupt" mask="0x80000000" name="COMMRX"/>
        </register>
        <register caption="Interrupt Mask Register" name="DBGU_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask COMMTX Interrupt" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Mask COMMRX Interrupt" mask="0x80000000" name="COMMRX"/>
        </register>
