MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="Status Register" name="DBGU_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Debug Communication Channel Write Status" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Debug Communication Channel Read Status" mask="0x80000000" name="COMMRX"/>
        </register>
        <register caption="Receive Holding Register" name="DBGU_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="DBGU_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="DBGU_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD" values="DBGU_BRGR__CD"/>
        </register>
        <register caption="Chip ID Register" name="DBGU_CIDR" offset="0x0040" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="DBGU_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="DBGU_CIDR__NVPSIZ"/>
          <bitfield caption="" mask="0x0000F000" name="NVPSIZ2" values="DBGU_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="DBGU_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="DBGU_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="DBGU_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="DBGU_EXID" offset="0x0044" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
        <register caption="Force NTRST Register" name="DBGU_FNR" offset="0x0048" rw="RW" size="4">
          <bitfield caption="Force NTRST" mask="0x00000001" name="FNTRST"/>
        </register>
      </register-group>
      <value-group caption="" name="DBGU_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Space: Parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: Parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No Parity" name="NONE" value="0x4"/>
      </value-group>
      <value-group caption="" name="DBGU_MR__CHMODE">
        <value caption="Normal Mode" name="NORM" value="0x0"/>
        <value caption="Automatic Echo" name="AUTO" value="0x1"/>
        <value caption="Local Loopback" name="LOCLOOP" value="0x2"/>
        <value caption="Remote Loopback" name="REMLOOP" value="0x3"/>
      </value-group>
      <value-group caption="" name="DBGU_BRGR__CD">
        <value caption="DBGU Disabled" name="DISABLED" value="0"/>
        <value caption="MCK" name="MCK" value="1"/>
      </value-group>
      <value-group caption="" name="DBGU_CIDR__EPROC">
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
      </value-group>
      <value-group caption="" name="DBGU_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8K bytes" name="_8K" value="0x1"/>
        <value caption="16K bytes" name="_16K" value="0x2"/>
        <value caption="32K bytes" name="_32K" value="0x3"/>
        <value caption="64K bytes" name="_64K" value="0x5"/>
        <value caption="128K bytes" name="_128K" value="0x7"/>
        <value caption="256K bytes" name="_256K" value="0x9"/>
        <value caption="512K bytes" name="_512K" value="0xA"/>
        <value caption="1024K bytes" name="_1024K" value="0xC"/>
        <value caption="2048K bytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="DBGU_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8K bytes" name="_8K" value="0x1"/>
        <value caption="16K bytes" name="_16K" value="0x2"/>
        <value caption="32K bytes" name="_32K" value="0x3"/>
        <value caption="64K bytes" name="_64K" value="0x5"/>
        <value caption="128K bytes" name="_128K" value="0x7"/>
        <value caption="256K bytes" name="_256K" value="0x9"/>
        <value caption="512K bytes" name="_512K" value="0xA"/>
        <value caption="1024K bytes" name="_1024K" value="0xC"/>
        <value caption="2048K bytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="DBGU_CIDR__SRAMSIZ">
        <value caption="1K bytes" name="_1K" value="0x1"/>
        <value caption="2K bytes" name="_2K" value="0x2"/>
        <value caption="6K bytes" name="_6K" value="0x3"/>
        <value caption="112K bytes" name="_112K" value="0x4"/>
        <value caption="4K bytes" name="_4K" value="0x5"/>
        <value caption="80K bytes" name="_80K" value="0x6"/>
        <value caption="160K bytes" name="_160K" value="0x7"/>
        <value caption="8K bytes" name="_8K" value="0x8"/>
        <value caption="16K bytes" name="_16K" value="0x9"/>
        <value caption="32K bytes" name="_32K" value="0xA"/>
        <value caption="64K bytes" name="_64K" value="0xB"/>
        <value caption="128K bytes" name="_128K" value="0xC"/>
        <value caption="256K bytes" name="_256K" value="0xD"/>
        <value caption="96K bytes" name="_96K" value="0xE"/>
        <value caption="512K bytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="DBGU_CIDR__ARCH">
        <value caption="AT91SAM9xx Series" name="AT91SAM9xx" value="0x19"/>
        <value caption="AT91SAM9XExx Series" name="AT91SAM9XExx" value="0x29"/>
        <value caption="AT91x34 Series" name="AT91x34" value="0x34"/>
        <value caption="CAP7 Series" name="CAP7" value="0x37"/>
        <value caption="CAP9 Series" name="CAP9" value="0x39"/>
        <value caption="CAP11 Series" name="CAP11" value="0x3B"/>
        <value caption="AT91x40 Series" name="AT91x40" value="0x40"/>
        <value caption="AT91x42 Series" name="AT91x42" value="0x42"/>
        <value caption="AT91x55 Series" name="AT91x55" value="0x55"/>
        <value caption="AT91SAM7Axx Series" name="AT91SAM7Axx" value="0x60"/>
        <value caption="AT91SAM7AQxx Series" name="AT91SAM7AQxx" value="0x61"/>
        <value caption="AT91x63 Series" name="AT91x63" value="0x63"/>
        <value caption="AT91SAM7Sxx Series" name="AT91SAM7Sxx" value="0x70"/>
        <value caption="AT91SAM7XCxx Series" name="AT91SAM7XCxx" value="0x71"/>
        <value caption="AT91SAM7SExx Series" name="AT91SAM7SExx" value="0x72"/>
        <value caption="AT91SAM7Lxx Series" name="AT91SAM7Lxx" value="0x73"/>
        <value caption="AT91SAM7Xxx Series" name="AT91SAM7Xxx" value="0x75"/>
        <value caption="AT91SAM7SLxx Series" name="AT91SAM7SLxx" value="0x76"/>
        <value caption="ATSAM3UxC Series (100-pin version)" name="ATSAM3UxC" value="0x80"/>
        <value caption="ATSAM3UxE Series (144-pin version)" name="ATSAM3UxE" value="0x81"/>
        <value caption="ATSAM3AxC Series (100-pin version)" name="ATSAM3AxC" value="0x83"/>
        <value caption="ATSAM3XxC Series (100-pin version)" name="ATSAM3XxC" value="0x84"/>
        <value caption="ATSAM3XxE Series (144-pin version)" name="ATSAM3XxE" value="0x85"/>
        <value caption="ATSAM3XxG Series (208/217-pin version)" name="ATSAM3XxG" value="0x86"/>
        <value caption="ATSAM3SxA Series (48-pin version)" name="ATSAM3SxA" value="0x88"/>
        <value caption="ATSAM3SxB Series (64-pin version)" name="ATSAM3SxB" value="0x89"/>
        <value caption="ATSAM3SxC Series (100-pin version)" name="ATSAM3SxC" value="0x8A"/>
        <value caption="AT91x92 Series" name="AT91x92" value="0x92"/>
        <value caption="ATSAM3NxA Series (48-pin version)" name="ATSAM3NxA" value="0x93"/>
        <value caption="ATSAM3NxB Series (64-pin version)" name="ATSAM3NxB" value="0x94"/>
        <value caption="ATSAM3NxC Series (100-pin version)" name="ATSAM3NxC" value="0x95"/>
        <value caption="ATSAM3SDxA Series (48-pin version)" name="ATSAM3SDxA" value="0x98"/>
        <value caption="ATSAM3SDxB Series (64-pin version)" name="ATSAM3SDxB" value="0x99"/>
        <value caption="ATSAM3SDxC Series (100-pin version)" name="ATSAM3SDxC" value="0x9A"/>
        <value caption="AT75Cxx Series" name="AT75Cxx" value="0xF0"/>
      </value-group>
      <value-group caption="" name="DBGU_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash MemoryNVPSIZ is ROM size      NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module caption="DMA Controller" name="DMAC" version="6233L">
      <register-group name="DMAC">
        <register caption="DMAC Global Configuration Register" name="DMAC_GCFG" offset="0x000" rw="RW" size="4">
          <bitfield caption="Arbiter Configuration" mask="0x00000010" name="ARB_CFG" values="DMAC_GCFG__ARB_CFG"/>
          <bitfield caption="Descriptor Integrity Check" mask="0x00000100" name="DICEN"/>
        </register>
