MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="Fuse Index Register" name="FUSE_IR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Write Status" mask="0x00000001" name="WS"/>
          <bitfield caption="Read Status" mask="0x00000002" name="RS"/>
          <bitfield caption="Word Selection" mask="0x00000F00" name="WSEL"/>
        </register>
        <register caption="Fuse Data Register" name="FUSE_DR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Data to Program" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Fuse Status Register 0" name="FUSE_SR0" offset="0x10" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 1" name="FUSE_SR1" offset="0x14" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 2" name="FUSE_SR2" offset="0x18" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 3" name="FUSE_SR3" offset="0x1C" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 4" name="FUSE_SR4" offset="0x20" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 5" name="FUSE_SR5" offset="0x24" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 6" name="FUSE_SR6" offset="0x28" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
        <register caption="Fuse Status Register 7" name="FUSE_SR7" offset="0x2C" rw="R" size="4">
          <bitfield caption="Fuse Status" mask="0xFFFFFFFF" name="FUSE"/>
        </register>
      </register-group>
      <value-group caption="" name="FUSE_CR__KEY">
        <value caption="valid key." name="VALID" value="0xFB"/>
      </value-group>
    </module>
    <module caption="Gigabit Ethernet MAC" name="GMAC" version="11046C">
      <register-group name="GMAC">
        <register caption="Network Control Register" name="GMAC_NCR" offset="0x000" rw="RW" size="4">
          <bitfield caption="Loop Back" mask="0x00000001" name="LB"/>
          <bitfield caption="Loop Back Local" mask="0x00000002" name="LBL"/>
          <bitfield caption="Receive Enable" mask="0x00000004" name="RXEN"/>
          <bitfield caption="Transmit Enable" mask="0x00000008" name="TXEN"/>
          <bitfield caption="Management Port Enable" mask="0x00000010" name="MPE"/>
          <bitfield caption="Clear Statistics Registers" mask="0x00000020" name="CLRSTAT"/>
          <bitfield caption="Increment Statistics Registers" mask="0x00000040" name="INCSTAT"/>
          <bitfield caption="Write Enable for Statistics Registers" mask="0x00000080" name="WESTAT"/>
          <bitfield caption="Back pressure" mask="0x00000100" name="BP"/>
          <bitfield caption="Start Transmission" mask="0x00000200" name="TSTART"/>
          <bitfield caption="Transmit Halt" mask="0x00000400" name="THALT"/>
          <bitfield caption="Transmit Pause Frame" mask="0x00000800" name="TXPF"/>
          <bitfield caption="Transmit Zero Quantum Pause Frame" mask="0x00001000" name="TXZQPF"/>
          <bitfield caption="Read Snapshot" mask="0x00004000" name="RDS"/>
          <bitfield caption="Store Receive Time Stamp to Memory" mask="0x00008000" name="SRTSM"/>
          <bitfield caption="Enable PFC Priority-based Pause Reception" mask="0x00010000" name="ENPBPR"/>
          <bitfield caption="Transmit PFC Priority-based Pause Frame" mask="0x00020000" name="TXPBPF"/>
          <bitfield caption="Flush Next Packet" mask="0x00040000" name="FNP"/>
        </register>
        <register caption="Network Configuration Register" name="GMAC_NCFGR" offset="0x004" rw="RW" size="4">
          <bitfield caption="Speed" mask="0x00000001" name="SPD"/>
          <bitfield caption="Full Duplex" mask="0x00000002" name="FD"/>
          <bitfield caption="Discard Non-VLAN FRAMES" mask="0x00000004" name="DNVLAN"/>
          <bitfield caption="Jumbo Frame Size" mask="0x00000008" name="JFRAME"/>
          <bitfield caption="Copy All Frames" mask="0x00000010" name="CAF"/>
          <bitfield caption="No Broadcast" mask="0x00000020" name="NBC"/>
          <bitfield caption="Multicast Hash Enable" mask="0x00000040" name="MTIHEN"/>
          <bitfield caption="Unicast Hash Enable" mask="0x00000080" name="UNIHEN"/>
          <bitfield caption="1536 Maximum Frame Size" mask="0x00000100" name="MAXFS"/>
          <bitfield caption="Gigabit Mode Enable" mask="0x00000400" name="GBE"/>
          <bitfield caption="Physical Interface Select" mask="0x00000800" name="PIS"/>
          <bitfield caption="Retry Test" mask="0x00001000" name="RTY"/>
          <bitfield caption="Pause Enable" mask="0x00002000" name="PEN"/>
          <bitfield caption="Receive Buffer Offset" mask="0x0000C000" name="RXBUFO"/>
          <bitfield caption="Length Field Error Frame Discard" mask="0x00010000" name="LFERD"/>
          <bitfield caption="Remove FCS" mask="0x00020000" name="RFCS"/>
          <bitfield caption="MDC CLock Division" mask="0x001C0000" name="CLK" values="GMAC_NCFGR__CLK"/>
          <bitfield caption="Data Bus Width" mask="0x00600000" name="DBW" values="GMAC_NCFGR__DBW"/>
          <bitfield caption="Disable Copy of Pause Frames" mask="0x00800000" name="DCPF"/>
          <bitfield caption="Receive Checksum Offload Enable" mask="0x01000000" name="RXCOEN"/>
          <bitfield caption="Enable Frames Received in Half Duplex" mask="0x02000000" name="EFRHD"/>
          <bitfield caption="Ignore RX FCS" mask="0x04000000" name="IRXFCS"/>
          <bitfield caption="IP Stretch Enable" mask="0x10000000" name="IPGSEN"/>
          <bitfield caption="Receive Bad Preamble" mask="0x20000000" name="RXBP"/>
          <bitfield caption="Ignore IPG rx_er" mask="0x40000000" name="IRXER"/>
        </register>
        <register caption="Network Status Register" name="GMAC_NSR" offset="0x008" rw="R" size="4">
          <bitfield caption="MDIO Input Status" mask="0x00000002" name="MDIO"/>
          <bitfield caption="PHY Management Logic Idle" mask="0x00000004" name="IDLE"/>
        </register>
        <register caption="User Register" name="GMAC_UR" offset="0x00C" rw="RW" size="4">
          <bitfield caption="RGMII Mode" mask="0x00000001" name="RGMII"/>
          <bitfield caption="Half Duplex Flow Control" mask="0x00000040" name="HDFC"/>
          <bitfield caption="BPDG Bypass Deglitchers" mask="0x00000080" name="BPDG"/>
        </register>
        <register caption="DMA Configuration Register" name="GMAC_DCFGR" offset="0x010" rw="RW" size="4">
          <bitfield caption="Fixed Burst Length for DMA Data Operations:" mask="0x0000001F" name="FBLDO" values="GMAC_DCFGR__FBLDO"/>
          <bitfield caption="Endian Swap Mode Enable for Management Descriptor Accesses" mask="0x00000040" name="ESMA"/>
          <bitfield caption="Endian Swap Mode Enable for Packet Data Accesses" mask="0x00000080" name="ESPA"/>
          <bitfield caption="Receiver Packet Buffer Memory Size Select" mask="0x00000300" name="RXBMS" values="GMAC_DCFGR__RXBMS"/>
          <bitfield caption="Transmitter Packet Buffer Memory Size Select" mask="0x00000400" name="TXPBMS"/>
          <bitfield caption="Transmitter Checksum Generation Offload Enable" mask="0x00000800" name="TXCOEN"/>
          <bitfield caption="DMA Receive Buffer Size" mask="0x00FF0000" name="DRBS"/>
          <bitfield caption="DMA Discard Receive Packets" mask="0x01000000" name="DDRP"/>
        </register>
        <register caption="Transmit Status Register" name="GMAC_TSR" offset="0x014" rw="RW" size="4">
          <bitfield caption="Used Bit Read" mask="0x00000001" name="UBR"/>
          <bitfield caption="Collision Occurred" mask="0x00000002" name="COL"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000004" name="RLE"/>
          <bitfield caption="Transmit Go" mask="0x00000008" name="TXGO"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000010" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000020" name="TXCOMP"/>
          <bitfield caption="Transmit Under Run" mask="0x00000040" name="UND"/>
          <bitfield caption="Late Collision Occurred" mask="0x00000080" name="LCO"/>
          <bitfield caption="HRESP Not OK" mask="0x00000100" name="HRESP"/>
        </register>
        <register caption="Receive Buffer Queue Base Address" name="GMAC_RBQB" offset="0x018" rw="RW" size="4">
          <bitfield caption="Receive buffer queue base address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address" name="GMAC_TBQB" offset="0x01C" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
        <register caption="Receive Status Register" name="GMAC_RSR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Buffer Not Available" mask="0x00000001" name="BNA"/>
          <bitfield caption="Frame Received" mask="0x00000002" name="REC"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000008" name="HNO"/>
        </register>
