MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="Frames Transmitted Register" name="GMAC_FT" offset="0x108" rw="R" size="4">
          <bitfield caption="Frames Transmitted without Error" mask="0xFFFFFFFF" name="FTX"/>
        </register>
        <register caption="Broadcast Frames Transmitted Register" name="GMAC_BCFT" offset="0x10C" rw="R" size="4">
          <bitfield caption="Broadcast Frames Transmitted without Error" mask="0xFFFFFFFF" name="BFTX"/>
        </register>
        <register caption="Multicast Frames Transmitted Register" name="GMAC_MFT" offset="0x110" rw="R" size="4">
          <bitfield caption="Multicast Frames Transmitted without Error" mask="0xFFFFFFFF" name="MFTX"/>
        </register>
        <register caption="Pause Frames Transmitted Register" name="GMAC_PFT" offset="0x114" rw="R" size="4">
          <bitfield caption="Pause Frames Transmitted Register" mask="0x0000FFFF" name="PFTX"/>
        </register>
        <register caption="64 Byte Frames Transmitted Register" name="GMAC_BFT64" offset="0x118" rw="R" size="4">
          <bitfield caption="64 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="65 to 127 Byte Frames Transmitted Register" name="GMAC_TBFT127" offset="0x11C" rw="R" size="4">
          <bitfield caption="65 to 127 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="128 to 255 Byte Frames Transmitted Register" name="GMAC_TBFT255" offset="0x120" rw="R" size="4">
          <bitfield caption="128 to 255 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="256 to 511 Byte Frames Transmitted Register" name="GMAC_TBFT511" offset="0x124" rw="R" size="4">
          <bitfield caption="256 to 511 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="512 to 1023 Byte Frames Transmitted Register" name="GMAC_TBFT1023" offset="0x128" rw="R" size="4">
          <bitfield caption="512 to 1023 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="1024 to 1518 Byte Frames Transmitted Register" name="GMAC_TBFT1518" offset="0x12C" rw="R" size="4">
          <bitfield caption="1024 to 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="Greater Than 1518 Byte Frames Transmitted Register" name="GMAC_GTBFT1518" offset="0x130" rw="R" size="4">
          <bitfield caption="Greater than 1518 Byte Frames Transmitted without Error" mask="0xFFFFFFFF" name="NFTX"/>
        </register>
        <register caption="Transmit Under Runs Register" name="GMAC_TUR" offset="0x134" rw="R" size="4">
          <bitfield caption="Transmit Under Runs" mask="0x000003FF" name="TXUNR"/>
        </register>
        <register caption="Single Collision Frames Register" name="GMAC_SCF" offset="0x138" rw="R" size="4">
          <bitfield caption="Single Collision" mask="0x0003FFFF" name="SCOL"/>
        </register>
        <register caption="Multiple Collision Frames Register" name="GMAC_MCF" offset="0x13C" rw="R" size="4">
          <bitfield caption="Multiple Collision" mask="0x0003FFFF" name="MCOL"/>
        </register>
        <register caption="Excessive Collisions Register" name="GMAC_EC" offset="0x140" rw="R" size="4">
          <bitfield caption="Excessive Collisions" mask="0x000003FF" name="XCOL"/>
        </register>
        <register caption="Late Collisions Register" name="GMAC_LC" offset="0x144" rw="R" size="4">
          <bitfield caption="Late Collisions" mask="0x000003FF" name="LCOL"/>
        </register>
        <register caption="Deferred Transmission Frames Register" name="GMAC_DTF" offset="0x148" rw="R" size="4">
          <bitfield caption="Deferred Transmission" mask="0x0003FFFF" name="DEFT"/>
        </register>
        <register caption="Carrier Sense Errors Register" name="GMAC_CSE" offset="0x14C" rw="R" size="4">
          <bitfield caption="Carrier Sense Error" mask="0x000003FF" name="CSR"/>
        </register>
        <register caption="Octets Received [31:0] Received" name="GMAC_ORLO" offset="0x150" rw="R" size="4">
          <bitfield caption="Received Octets" mask="0xFFFFFFFF" name="RXO"/>
        </register>
        <register caption="Octets Received [47:32] Received" name="GMAC_ORHI" offset="0x154" rw="R" size="4">
          <bitfield caption="Received Octets" mask="0x0000FFFF" name="RXO"/>
        </register>
        <register caption="Frames Received Register" name="GMAC_FR" offset="0x158" rw="R" size="4">
          <bitfield caption="Frames Received without Error" mask="0xFFFFFFFF" name="FRX"/>
        </register>
        <register caption="Broadcast Frames Received Register" name="GMAC_BCFR" offset="0x15C" rw="R" size="4">
          <bitfield caption="Broadcast Frames Received without Error" mask="0xFFFFFFFF" name="BFRX"/>
        </register>
        <register caption="Multicast Frames Received Register" name="GMAC_MFR" offset="0x160" rw="R" size="4">
          <bitfield caption="Multicast Frames Received without Error" mask="0xFFFFFFFF" name="MFRX"/>
        </register>
        <register caption="Pause Frames Received Register" name="GMAC_PFR" offset="0x164" rw="R" size="4">
          <bitfield caption="Pause Frames Received Register" mask="0x0000FFFF" name="PFRX"/>
        </register>
        <register caption="64 Byte Frames Received Register" name="GMAC_BFR64" offset="0x168" rw="R" size="4">
          <bitfield caption="64 Byte Frames Received without Error" mask="0xFFFFFFFF" name="NFRX"/>
        </register>
        <register caption="65 to 127 Byte Frames Received Register" name="GMAC_TBFR127" offset="0x16C" rw="R" size="4">
          <bitfield caption="65 to 127 Byte Frames Received without Error" mask="0xFFFFFFFF" name="NFRX"/>
        </register>
        <register caption="128 to 255 Byte Frames Received Register" name="GMAC_TBFR255" offset="0x170" rw="R" size="4">
          <bitfield caption="128 to 255 Byte Frames Received without Error" mask="0xFFFFFFFF" name="NFRX"/>
        </register>
