MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="Transmit Buffer Queue Base Address Priority Queue 6" name="GMAC_TBQBAPQ6" offset="0x458" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 0" name="GMAC_RBQBAPQ0" offset="0x480" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 1" name="GMAC_RBQBAPQ1" offset="0x484" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 2" name="GMAC_RBQBAPQ2" offset="0x488" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 3" name="GMAC_RBQBAPQ3" offset="0x48C" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 4" name="GMAC_RBQBAPQ4" offset="0x490" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 5" name="GMAC_RBQBAPQ5" offset="0x494" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Priority Queue 6" name="GMAC_RBQBAPQ6" offset="0x498" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 0" name="GMAC_RBSRPQ0" offset="0x4A0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 1" name="GMAC_RBSRPQ1" offset="0x4A4" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 2" name="GMAC_RBSRPQ2" offset="0x4A8" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 3" name="GMAC_RBSRPQ3" offset="0x4AC" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 4" name="GMAC_RBSRPQ4" offset="0x4B0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 5" name="GMAC_RBSRPQ5" offset="0x4B4" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue 6" name="GMAC_RBSRPQ6" offset="0x4B8" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 0" name="GMAC_ST1RPQ0" offset="0x500" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 1" name="GMAC_ST1RPQ1" offset="0x504" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 2" name="GMAC_ST1RPQ2" offset="0x508" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 3" name="GMAC_ST1RPQ3" offset="0x50C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 4" name="GMAC_ST1RPQ4" offset="0x510" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 5" name="GMAC_ST1RPQ5" offset="0x514" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 6" name="GMAC_ST1RPQ6" offset="0x518" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 7" name="GMAC_ST1RPQ7" offset="0x51C" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 8" name="GMAC_ST1RPQ8" offset="0x520" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 9" name="GMAC_ST1RPQ9" offset="0x524" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type1 Register Priority Queue 10" name="GMAC_ST1RPQ10" offset="0x528" rw="RW" size="4">
          <bitfield caption="Que Number (0-&gt;7)" mask="0x0000000F" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
