MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="FIFO Memory Aperture0 161" name="HSMCI_FIFO161" offset="0x484" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 162" name="HSMCI_FIFO162" offset="0x488" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 163" name="HSMCI_FIFO163" offset="0x48C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 164" name="HSMCI_FIFO164" offset="0x490" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 165" name="HSMCI_FIFO165" offset="0x494" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 166" name="HSMCI_FIFO166" offset="0x498" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 167" name="HSMCI_FIFO167" offset="0x49C" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 168" name="HSMCI_FIFO168" offset="0x4A0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 169" name="HSMCI_FIFO169" offset="0x4A4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 170" name="HSMCI_FIFO170" offset="0x4A8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 171" name="HSMCI_FIFO171" offset="0x4AC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 172" name="HSMCI_FIFO172" offset="0x4B0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 173" name="HSMCI_FIFO173" offset="0x4B4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 174" name="HSMCI_FIFO174" offset="0x4B8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 175" name="HSMCI_FIFO175" offset="0x4BC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 176" name="HSMCI_FIFO176" offset="0x4C0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 177" name="HSMCI_FIFO177" offset="0x4C4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 178" name="HSMCI_FIFO178" offset="0x4C8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 179" name="HSMCI_FIFO179" offset="0x4CC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 180" name="HSMCI_FIFO180" offset="0x4D0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 181" name="HSMCI_FIFO181" offset="0x4D4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 182" name="HSMCI_FIFO182" offset="0x4D8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 183" name="HSMCI_FIFO183" offset="0x4DC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 184" name="HSMCI_FIFO184" offset="0x4E0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 185" name="HSMCI_FIFO185" offset="0x4E4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 186" name="HSMCI_FIFO186" offset="0x4E8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 187" name="HSMCI_FIFO187" offset="0x4EC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 188" name="HSMCI_FIFO188" offset="0x4F0" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 189" name="HSMCI_FIFO189" offset="0x4F4" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 190" name="HSMCI_FIFO190" offset="0x4F8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 191" name="HSMCI_FIFO191" offset="0x4FC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
