MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="UTMI DP/DM Pin Swapping Register" name="SFR_UTMISWAP" offset="0x3C" rw="RW" size="4">
          <bitfield caption="PORT 0 DP/DM Pin Swapping" mask="0x00000001" name="PORT0" values="SFR_UTMISWAP__PORT0"/>
          <bitfield caption="PORT 1 DP/DM Pin Swapping" mask="0x00000002" name="PORT1" values="SFR_UTMISWAP__PORT1"/>
          <bitfield caption="PORT 2 DP/DM Pin Swapping" mask="0x00000004" name="PORT2" values="SFR_UTMISWAP__PORT2"/>
        </register>
        <register caption="EBI Configuration Register" name="SFR_EBICFG" offset="0x40" rw="RW" size="4">
          <bitfield caption="EBI Pins Drive Level" mask="0x00000003" name="DRIVE0" values="SFR_EBICFG__DRIVE0"/>
          <bitfield caption="EBI Pins Pull Value" mask="0x0000000C" name="PULL0" values="SFR_EBICFG__PULL0"/>
          <bitfield caption="EBI Pins Schmitt Trigger" mask="0x00000010" name="SCH0"/>
          <bitfield caption="EBI Pins Drive Level" mask="0x00000300" name="DRIVE1" values="SFR_EBICFG__DRIVE1"/>
          <bitfield caption="EBI Pins Pull Value" mask="0x00000C00" name="PULL1" values="SFR_EBICFG__PULL1"/>
          <bitfield caption="EBI Pins Schmitt Trigger" mask="0x00001000" name="SCH1"/>
          <bitfield caption="BMS Sampled Value (Read Only)" mask="0x00010000" name="BMS" values="SFR_EBICFG__BMS"/>
        </register>
      </register-group>
      <value-group caption="" name="SFR_AHB__PFETCH10">
        <value caption="INCR undefined burst converted to burst of 4 beats." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 beats." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_AHB__PFETCH11">
        <value caption="INCR undefined burst converted to burst of 4 beats." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 beats." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_AHB__PFETCH12">
        <value caption="INCR undefined burst converted to burst of 4 beats." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 beats." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_AHB__PFETCH13">
        <value caption="INCR undefined burst converted to burst of 4 beats." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 beats." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_AHB__PFETCH14">
        <value caption="INCR undefined burst converted to burst of 4 beats." name="INCR4" value="0"/>
        <value caption="INCR undefined burst converted to burst of 8 beats." name="INCR8" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_BRIDGE__AXI2AHBSEL">
        <value caption="use single port bridge." name="SINGLE" value="0"/>
        <value caption="use dual port bridge." name="DUAL" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_UTMICKTRIM__FREQ">
        <value caption="12 MHz reference clock" name="_12" value="0x0"/>
        <value caption="16 MHz reference clock" name="_16" value="0x1"/>
        <value caption="24 MHz reference clock" name="_24" value="0x2"/>
        <value caption="48 MHz reference clock" name="_48" value="0x3"/>
      </value-group>
      <value-group caption="" name="SFR_UTMISWAP__PORT0">
        <value caption="DP/DM normal pinout." name="NORMAL" value="0"/>
        <value caption="DP/DM swapped pinout." name="SWAPPED" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_UTMISWAP__PORT1">
        <value caption="DP/DM normal pinout." name="NORMAL" value="0"/>
        <value caption="DP/DM swapped pinout." name="SWAPPED" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_UTMISWAP__PORT2">
        <value caption="DP/DM normal pinout." name="NORMAL" value="0"/>
        <value caption="DP/DM swapped pinout." name="SWAPPED" value="1"/>
      </value-group>
      <value-group caption="" name="SFR_EBICFG__DRIVE0">
        <value caption="Low drive level" name="LOW" value="0x0"/>
        <value caption="Medium drive level" name="MEDIUM" value="0x2"/>
        <value caption="High drive level" name="HIGH" value="0x3"/>
      </value-group>
      <value-group caption="" name="SFR_EBICFG__PULL0">
        <value caption="Pull-up" name="UP" value="0x0"/>
        <value caption="No Pull" name="NONE" value="0x1"/>
        <value caption="Pull-down" name="DOWN" value="0x3"/>
      </value-group>
      <value-group caption="" name="SFR_EBICFG__DRIVE1">
        <value caption="Low drive level" name="LOW" value="0x0"/>
        <value caption="Medium drive level" name="MEDIUM" value="0x2"/>
        <value caption="High drive level" name="HIGH" value="0x3"/>
      </value-group>
      <value-group caption="" name="SFR_EBICFG__PULL1">
        <value caption="Pull-up" name="UP" value="0x0"/>
        <value caption="No Pull" name="NONE" value="0x1"/>
        <value caption="Pull-down" name="DOWN" value="0x3"/>
      </value-group>
      <value-group caption="" name="SFR_EBICFG__BMS">
        <value caption="Boot on ROM." name="ROM" value="0"/>
        <value caption="Boot on EBI." name="EBI" value="1"/>
      </value-group>
    </module>
    <module caption="Shutdown Controller" name="SHDWC" version="6122L">
      <register-group name="SHDWC">
        <register caption="Shutdown Control Register" name="SHDW_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Shutdown Command" mask="0x00000001" name="SHDW"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
        <register caption="Shutdown Mode Register" name="SHDW_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Wake-up Mode 0" mask="0x00000003" name="WKMODE0"/>
          <bitfield caption="Counter on Wake-up 0" mask="0x000000F0" name="CPTWK0"/>
          <bitfield caption="Real-time Clock Wake-up Enable" mask="0x00020000" name="RTCWKEN"/>
        </register>
        <register caption="Shutdown Status Register" name="SHDW_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Wake-up 0 Status" mask="0x00000001" name="WAKEUP0"/>
          <bitfield caption="Real-time Clock Wake-up" mask="0x00020000" name="RTCWK"/>
        </register>
      </register-group>
    </module>
