MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="PMECC Redundancy 6 Register (sec_num = 5)" name="SMC_PMECC6_5" offset="0x208" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 5)" name="SMC_PMECC7_5" offset="0x20C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 5)" name="SMC_PMECC8_5" offset="0x210" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 5)" name="SMC_PMECC9_5" offset="0x214" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 5)" name="SMC_PMECC10_5" offset="0x218" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 6)" name="SMC_PMECC0_6" offset="0x230" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 6)" name="SMC_PMECC1_6" offset="0x234" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 6)" name="SMC_PMECC2_6" offset="0x238" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 6)" name="SMC_PMECC3_6" offset="0x23C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 6)" name="SMC_PMECC4_6" offset="0x240" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 6)" name="SMC_PMECC5_6" offset="0x244" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 6 Register (sec_num = 6)" name="SMC_PMECC6_6" offset="0x248" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 6)" name="SMC_PMECC7_6" offset="0x24C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 6)" name="SMC_PMECC8_6" offset="0x250" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 6)" name="SMC_PMECC9_6" offset="0x254" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 6)" name="SMC_PMECC10_6" offset="0x258" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 0 Register (sec_num = 7)" name="SMC_PMECC0_7" offset="0x270" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 1 Register (sec_num = 7)" name="SMC_PMECC1_7" offset="0x274" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 2 Register (sec_num = 7)" name="SMC_PMECC2_7" offset="0x278" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 3 Register (sec_num = 7)" name="SMC_PMECC3_7" offset="0x27C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 4 Register (sec_num = 7)" name="SMC_PMECC4_7" offset="0x280" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 5 Register (sec_num = 7)" name="SMC_PMECC5_7" offset="0x284" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 6 Register (sec_num = 7)" name="SMC_PMECC6_7" offset="0x288" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 7 Register (sec_num = 7)" name="SMC_PMECC7_7" offset="0x28C" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 8 Register (sec_num = 7)" name="SMC_PMECC8_7" offset="0x290" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 9 Register (sec_num = 7)" name="SMC_PMECC9_7" offset="0x294" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Redundancy 10 Register (sec_num = 7)" name="SMC_PMECC10_7" offset="0x298" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
        <register caption="PMECC Remainder 0 Register (sec_num = 0)" name="SMC_REM0_0" offset="0x2B0" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 1 Register (sec_num = 0)" name="SMC_REM1_0" offset="0x2B4" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
