MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="PMECC Remainder 2 Register (sec_num = 0)" name="SMC_REM2_0" offset="0x2B8" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 3 Register (sec_num = 0)" name="SMC_REM3_0" offset="0x2BC" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 0)" name="SMC_REM4_0" offset="0x2C0" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 0)" name="SMC_REM5_0" offset="0x2C4" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 0)" name="SMC_REM6_0" offset="0x2C8" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 0)" name="SMC_REM7_0" offset="0x2CC" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 0)" name="SMC_REM8_0" offset="0x2D0" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 0)" name="SMC_REM9_0" offset="0x2D4" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 10 Register (sec_num = 0)" name="SMC_REM10_0" offset="0x2D8" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 11 Register (sec_num = 0)" name="SMC_REM11_0" offset="0x2DC" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 0 Register (sec_num = 1)" name="SMC_REM0_1" offset="0x2F0" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 1 Register (sec_num = 1)" name="SMC_REM1_1" offset="0x2F4" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 2 Register (sec_num = 1)" name="SMC_REM2_1" offset="0x2F8" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 3 Register (sec_num = 1)" name="SMC_REM3_1" offset="0x2FC" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 1)" name="SMC_REM4_1" offset="0x300" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 1)" name="SMC_REM5_1" offset="0x304" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 1)" name="SMC_REM6_1" offset="0x308" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 1)" name="SMC_REM7_1" offset="0x30C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 1)" name="SMC_REM8_1" offset="0x310" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 1)" name="SMC_REM9_1" offset="0x314" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 10 Register (sec_num = 1)" name="SMC_REM10_1" offset="0x318" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 11 Register (sec_num = 1)" name="SMC_REM11_1" offset="0x31C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 0 Register (sec_num = 2)" name="SMC_REM0_2" offset="0x330" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 1 Register (sec_num = 2)" name="SMC_REM1_2" offset="0x334" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 2 Register (sec_num = 2)" name="SMC_REM2_2" offset="0x338" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
