MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="PMECC Remainder 3 Register (sec_num = 2)" name="SMC_REM3_2" offset="0x33C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 2)" name="SMC_REM4_2" offset="0x340" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 2)" name="SMC_REM5_2" offset="0x344" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 2)" name="SMC_REM6_2" offset="0x348" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 2)" name="SMC_REM7_2" offset="0x34C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 2)" name="SMC_REM8_2" offset="0x350" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 2)" name="SMC_REM9_2" offset="0x354" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 10 Register (sec_num = 2)" name="SMC_REM10_2" offset="0x358" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 11 Register (sec_num = 2)" name="SMC_REM11_2" offset="0x35C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 0 Register (sec_num = 3)" name="SMC_REM0_3" offset="0x370" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 1 Register (sec_num = 3)" name="SMC_REM1_3" offset="0x374" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 2 Register (sec_num = 3)" name="SMC_REM2_3" offset="0x378" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 3 Register (sec_num = 3)" name="SMC_REM3_3" offset="0x37C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 3)" name="SMC_REM4_3" offset="0x380" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 3)" name="SMC_REM5_3" offset="0x384" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 3)" name="SMC_REM6_3" offset="0x388" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 3)" name="SMC_REM7_3" offset="0x38C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 3)" name="SMC_REM8_3" offset="0x390" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 3)" name="SMC_REM9_3" offset="0x394" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
