MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
        <register caption="PMECC Remainder 1 Register (sec_num = 6)" name="SMC_REM1_6" offset="0x434" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 2 Register (sec_num = 6)" name="SMC_REM2_6" offset="0x438" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 3 Register (sec_num = 6)" name="SMC_REM3_6" offset="0x43C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 6)" name="SMC_REM4_6" offset="0x440" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 6)" name="SMC_REM5_6" offset="0x444" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 6)" name="SMC_REM6_6" offset="0x448" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 6)" name="SMC_REM7_6" offset="0x44C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 6)" name="SMC_REM8_6" offset="0x450" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 6)" name="SMC_REM9_6" offset="0x454" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 10 Register (sec_num = 6)" name="SMC_REM10_6" offset="0x458" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 11 Register (sec_num = 6)" name="SMC_REM11_6" offset="0x45C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 0 Register (sec_num = 7)" name="SMC_REM0_7" offset="0x470" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 1 Register (sec_num = 7)" name="SMC_REM1_7" offset="0x474" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 2 Register (sec_num = 7)" name="SMC_REM2_7" offset="0x478" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 3 Register (sec_num = 7)" name="SMC_REM3_7" offset="0x47C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 4 Register (sec_num = 7)" name="SMC_REM4_7" offset="0x480" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 5 Register (sec_num = 7)" name="SMC_REM5_7" offset="0x484" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 6 Register (sec_num = 7)" name="SMC_REM6_7" offset="0x488" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 7 Register (sec_num = 7)" name="SMC_REM7_7" offset="0x48C" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 8 Register (sec_num = 7)" name="SMC_REM8_7" offset="0x490" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 9 Register (sec_num = 7)" name="SMC_REM9_7" offset="0x494" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
