MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D35.atdf
      <value-group caption="" name="SMC_PMECCFG__BCH_ERR">
        <value caption="2 errors" name="BCH_ERR2" value="0x0"/>
        <value caption="4 errors" name="BCH_ERR4" value="0x1"/>
        <value caption="8 errors" name="BCH_ERR8" value="0x2"/>
        <value caption="12 errors" name="BCH_ERR12" value="0x3"/>
        <value caption="24 errors" name="BCH_ERR24" value="0x4"/>
      </value-group>
      <value-group caption="" name="SMC_PMECCFG__PAGESIZE">
        <value caption="1 sector for main area (512 or 1024 Bytes)" name="PAGESIZE_1SEC" value="0x0"/>
        <value caption="2 sectors for main area (1024 or 2048 Bytes)" name="PAGESIZE_2SEC" value="0x1"/>
        <value caption="4 sectors for main area (2048 or 4096 Bytes)" name="PAGESIZE_4SEC" value="0x2"/>
        <value caption="8 sectors for main area (4096 or 8192 Bytes)" name="PAGESIZE_8SEC" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE2__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__READ_MODE">
        <value caption="The Read operation is controlled by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Read operation is controlled by the NRD signal." name="NRD_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__WRITE_MODE">
        <value caption="The Write operation is controller by the NCS signal." name="NCS_CTRL" value="0"/>
        <value caption="The Write operation is controlled by the NWE signal." name="NWE_CTRL" value="1"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE3__DBW">
        <value caption="8-bit bus" name="BIT_8" value="0"/>
        <value caption="16-bit bus" name="BIT_16" value="1"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI" version="6088R">
      <register-group name="SPI">
        <register caption="Control Register" name="SPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
        </register>
        <register caption="Mode Register" name="SPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Master/Slave Mode" mask="0x00000001" name="MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="SPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
        </register>
